### 1.Write a program that calculates the factorial of a number input by the user using a while loop.

In [5]:
### Factorial Calculation
# Write a program that calculates the factorial of a number input by the user using a while loop.
# n= 5 ==> 1*2*3*4*5
number = int(input('enter a number'))
factorial = 1
i =1
while i<=number:
    factorial = factorial * i
    i=i+1

print(factorial)

enter a number 4

24

In [21]:
n = int(input('enter a number'))
factorial = 1

for i in range(1,n+1):
    # print(i)
    factorial =factorial * i

print(factorial)

enter a number 5

120

### 2.Write a program that calculates the sum of the digits of a number input by the user using a while loop.

In [28]:
# Sum of Digits
# Write a program that calculates the sum of the digits of a number input by the user using a while loop.
# 123 = 1+2+3 =6

num = int(input())
sum= 0
while num>0:
    # n = num%10
    sum = sum+ (num%10)
    num =  num //10

print(sum)

 234

9

In [26]:
num = int(input())
sum = 0
for i in range(len(str(num))):
    # n = num % 10
    sum = sum + (num%10)
    num = num //10

print(sum)

 2345

14

In [12]:
len(str(123))

3

In [32]:
4%2

0

In [80]:
11 // 2

5

### 3.Write a program that checks if a number input by the user is a prime number using a for loop.

In [191]:
# ### Prime Number Check
# Write a program that checks if a number input by the user is a prime number using a for loop.

n = 21
for i in range(2,(n//2)+1):
    # print(i)
    if n % i ==0:        
        print('Number is not prime')
        break
else:
    print('number is prime')

Number is not prime

### 4.Write a program to print prime numbers

In [195]:
# Write a program to print prime numbers
n = int(input('enter a number'))

for num in range(1,n+1):
    count = 0
    for i in range(2,(num//2)+1):
        if num % i == 0:
            count = count +1
            break
    if (count ==0 and num !=1):
        # print(num)
        print(" %d" %num, end = '  ')

enter a number 30

 2   3   5   7   11   13   17   19   23   29

### 5.Write a program that prints the first n Fibonacci numbers, where n is input by the user.

In [226]:
n= int(input())
count = 0
a = 0
b = 1
while count<n:
    print(b)
    a ,b = b,a+b
    count = count+1
    # print(b)

 10

1
1
2
3
5
8
13
21
34
55

In [230]:
n = int(input())
a , b = 0,1
for i in range(n):
    print(b)
    a,b = b,a+b

 10

1
1
2
3
5
8
13
21
34
55

### 6.Sorting a List without using sort function

In [254]:
li = [2,5,3,6,4,9,8]

for i in range(len(li)):
    # print(li[i])
    for j in range(i+1,len(li)):
        # print(li[j])
        if li[i] >= li[j]:
            li[i],li[j] = li[j],li[i]
print(li)

[2, 3, 4, 5, 6, 8, 9]

In [260]:
li = [2,5,3,6,4,9,8]

for i in range(len(li)):
    # print(li[i])
    for j in range(i+1,len(li)):
        # print(li[j])
        if li[i] <= li[j]:
            li[i],li[j] = li[j],li[i]
print(li)

[9, 8, 6, 5, 4, 3, 2]

In [ ]:
tweet_id	user_id	msg	tweet_date
214252	111	Am considering taking Tesla private at $420. Funding secured.	12/30/2021 00:00:00
739252	111	Despite the constant negative press covfefe	01/01/2022 00:00:00
846402	111	Following @NickSinghTech on Twitter changed my life!	02/14/2022 00:00:00
241425	254	If the salary is so competitive why wonâ€™t you tell me what it is?	03/01/2022 00:00:00
231574	148	I no longer have a manager. I can't be managed	03/23/2022 00:00:00

In [270]:
dict = {'tweet_id' : [214252,739252,846402,241425,231574],
        'user_id' : [111,111,111,254,148],
        'msg' : ['Am considering taking Tesla private at $420',
                 'Despite the constant negative press covfefe',
                 'Following @NickSinghTech on Twitter changed my life!',
                 'If the salary is so competitive why wont you tell me what it is?',
                 'I no longer have a manager I cant be managed'],
                 
        'tweet_date'  : ['12/30/2021 00:00:00','01/01/2022 00:00:00','02/14/2022 00:00:00','03/01/2022 00:00:00','03/23/2022 00:00:00']}

In [274]:
import pandas as pd

In [288]:
df = pd.DataFrame(dict)

In [306]:
df['tweet_date'] = pd.to_datetime(df['tweet_date'])

In [310]:
df

,tweet_id,user_id,msg,tweet_date
0,214252,111,Am considering taking Tesla private at $420,2021-12-30
1,739252,111,Despite the constant negative press covfefe,2022-01-01
2,846402,111,Following @NickSinghTech on Twitter changed my...,2022-02-14
3,241425,254,If the salary is so competitive why wont you t...,2022-03-01
4,231574,148,I no longer have a manager I cant be managed,2022-03-23

In [286]:
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [330]:
query = ('''select 
user_id,count(msg) as tweet_bucket
from df
where tweet_date between '2022-01-01' and '2022-12-31'
group by user_id

''')
report=pysqldf(query)
report

   user_id  tweet_bucket
0      111             2
1      148             1
2      254             1

In [318]:
# tweet_bucket	users_num
# 1	               2
# 2	               1

In [334]:
query1 = ('''select tweet_bucket,count(user_id) as user_num
from report
group by tweet_bucket

''')
report1 = pysqldf(query1)
report1

   tweet_bucket  user_num
0             1         2
1             2         1

In [336]:
query2 = (''' select tweet_bucket,count(user_id) as user_num
from
(select 
user_id,count(msg) as tweet_bucket
from df
where tweet_date between '2022-01-01' and '2022-12-31'
group by user_id)
group by tweet_bucket

''')
report2 =pysqldf(query2)
report2

   tweet_bucket  user_num
0             1         2
1             2         1